2025.10.28.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-28 Tue 14:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2025.10.21.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2025.11.04.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of October 21 to 28, 2025.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">opam 2.5.0~alpha1</a></li>
<li><a href="#2">Release of Fmlib 0.6.0</a></li>
<li><a href="#3">MlFront 2.4.2.x</a></li>
<li><a href="#4">Other OCaml News</a></li>
<li><a href="#org6189a04">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">opam 2.5.0~alpha1</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-opam-2-5-0-alpha1/17411/1">https://discuss.ocaml.org/t/ann-opam-2-5-0-alpha1/17411/1</a>
</p>
</div>
<div id="outline-container-org3600155" class="outline-3">
<h3 id="org3600155">Kate announced</h3>
<div class="outline-text-3" id="text-org3600155">
<p>
Hi everyone,
</p>

<p>
We are happy to announce the first alpha release of opam 2.5.0.
</p>

<p>
This version is an alpha, we invite users to test it to spot previously unnoticed bugs as we head towards the stable release.
</p>
</div>
<div id="outline-container-orgf37be68" class="outline-4">
<h4 id="orgf37be68">What’s new? Some highlights:</h4>
<div class="outline-text-4" id="text-orgf37be68">
<ul class="org-ul">
<li>:high_speed_train: Speed up <code>opam update</code> up to 70%. Thanks to <a href="https://github.com/arozovyk">@arozovyk</a>, <code>opam update</code> now loads opam files incrementally, only parsing the files that have changed since the last time you called <code>opam update</code>. Before that, opam files in opam repositories were all loaded from the file system after an update if there was any change. The performance improvement of this change thus depends on how often you call <code>opam update</code> and what type of repository and OS you are using. (<a href="https://github.com/ocaml/opam/issues/5824">#5824</a>)</li>

<li>:spiral_shell: Improved shell integration. A number of users have been hitting issues with opam's shell integration where parts of a previous environment was kept in the current environment, causing a number of issues. These can be triggered by, for example, nuking your opam root directory (by default <code>~/.opam</code> or <code>%LocalAppData%\opam</code>). For this particular case we are still working on a fix, but many other users have reported similar issues without nuking their root directory and in that case we believe to have fixed the majority of issues. (<a href="https://github.com/dbuenzli/topkg/issues/142">dbuenzli/topkg#142</a>, <a href="https://github.com/ocaml/opam/issues/4649">#4649</a>, <a href="https://github.com/ocaml/opam/issues/5761">#5761</a>)</li>

<li>:spiral_shell:² We've also changed the default file to which <code>opam init</code> writes the opam shell integration to be <code>.bashrc</code> instead of the previous <code>.profile</code> or <code>.bash_profile</code> when <code>bash</code> is detected.  Doing it this way prevents some issues with existing <code>.profile</code> files that source the <code>.bashrc</code> file and causing an infinite loop when opam asks users to ensure they source their <code>.bashrc</code> file in their <code>.profile</code> file. (<a href="https://github.com/ocaml/opam/issues/5819">#5819</a>, <a href="https://github.com/ocaml/opam/issues/4201">#4201</a>, <a href="https://github.com/ocaml/opam/issues/3990">#3990</a>)</li>

<li>:shield: The opam install script now installs an appropriate <code>apparmor</code> profile on systems configured with <code>apparmor</code> (this is enabled by default on Ubuntu). This change is not strictly speaking related to this release as it is deployed for every version. (<a href="https://github.com/ocaml/opam/issues/5968">#5968</a>)</li>

<li>:ocean: Many more UI additions and improvements, bug fixes, …</li>
</ul>


<p>
:open_book: You can read our <a href="https://opam.ocaml.org/blog/opam-2-5-0-alpha1/">blog post</a> for more information about these changes and more, and for even more details you can take a look at the <a href="https://github.com/ocaml/opam/releases/tag/2.5.0-alpha1">release note</a> or the <a href="https://github.com/ocaml/opam/blob/2.5.0-alpha1/CHANGES">changelog</a>.
</p>
</div>
</div>
<div id="outline-container-org04c77fd" class="outline-4">
<h4 id="org04c77fd">Try it!</h4>
<div class="outline-text-4" id="text-org04c77fd">
<p>
The upgrade instructions are unchanged:
</p>

<pre class="example" id="org6746b7f">
bash -c "sh &lt;(curl -fsSL https://opam.ocaml.org/install.sh) --version 2.5.0~alpha1"
</pre>
<p>
or from PowerShell for Windows systems
</p>
<pre class="example" id="org5b23ae8">
Invoke-Expression "&amp; { $(Invoke-RestMethod https://opam.ocaml.org/install.ps1) } -Version 2.5.0~alpha1"
</pre>

<p>
Please report any issues to the <a href="https://github.com/ocaml/opam/issues">bug-tracker</a>.
</p>

<p>
Happy hacking,
&lt;&gt; &lt;&gt; The opam team &lt;&gt; &lt;&gt; :camel:
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">Release of Fmlib 0.6.0</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-release-of-fmlib-0-6-0/17412/1">https://discuss.ocaml.org/t/ann-release-of-fmlib-0-6-0/17412/1</a>
</p>
</div>
<div id="outline-container-org9b53112" class="outline-3">
<h3 id="org9b53112">Helmut announced</h3>
<div class="outline-text-3" id="text-org9b53112">
<p>
I have the pleasure to annouce the release of version 0.6.0 of <code>fmlib</code>. The main components of <code>fmlib</code> are
</p>

<ol class="org-ol">
<li>Web Applications in the Elm style</li>
<li>Pretty Printing</li>
<li>Combinator Parsing</li>
</ol>

<p>
Documentation see <a href="https://hbr.github.io/fmlib/odoc/index.html">https://hbr.github.io/fmlib/odoc/index.html</a>.
</p>

<p>
This release is mainly focussed on pretty printing and web applications. The new release has some breaking changes because some function names or function arguments have changed. The breaking changes can be easily fixed by looking into the documentation which contains all functions and the corresponding arguments.
</p>

<p>
Web applications:
</p>

<ul class="org-ul">
<li>Single page applications are now fully supported. I.e. it is possible to manage several virtual pages in one application. The switching between the pages can be done by accessing the browser history. I.e. the user is capable of pressing back and forward buttons and the application remains the same. For an introduction to single page applications see <a href="https://hbr.github.io/fmlib/odoc/fmlib_browser/doc_single_page_application.html">here</a>. An example of a single page application can be seen <a href="https://hbr.github.io/fmlib/webapp/single_page.html">here</a>.</li>
<li>Web applications can contain reference elements. These can be used to optimize applications with really big doms (e.g. several hundreds or thousands of elements). Introduction to reference elements see <a href="https://hbr.github.io/fmlib/odoc/fmlib_browser/doc_reference_elements.html">here</a>. A simple spreadsheet implemented as a web application can be found <a href="https://hbr.github.io/fmlib/webapp/spreadsheet.html">here</a>.</li>
<li>Files on the local machine can be selected and loaded into the application.</li>
<li>Session and local storage of the browser can be used.</li>
</ul>

<p>
Pretty Printing: A new algorithm based on Phil Wadler’s design is used which makes the code more elegant, easy to read and fixes some bugs in the previous algorithm. The new algorithm is in a separate module <code>Pretty</code>. The old module <code>Print</code> is kept but will be removed in the next release.
</p>

<p>
Combinator Parsing: As a convenience there are lexeme parsers which support languages with some standard syntax (like Haskell’s Parsec). Some bugfixes and minor additional functions. No breaking changes.
</p>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">MlFront 2.4.2.x</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-mlfront-2-4-2-x/17427/1">https://discuss.ocaml.org/t/ann-mlfront-2-4-2-x/17427/1</a>
</p>
</div>
<div id="outline-container-orgeb669f1" class="outline-3">
<h3 id="orgeb669f1">jbeckford announced</h3>
<div class="outline-text-3" id="text-orgeb669f1">
<p>
MlFront 2.4.2.30, a set of packages centered around language-agnostic build tooling, is available on opam. Changes include:
</p>

<ul class="org-ul">
<li>MlFront_Core: <code>FilePath.absolute</code> has flags to create Windows paths longer than 260-characters (<code>MAX_PATH</code>).</li>
<li>MlFront_ZipFile: Now has a <code>deterministic</code> mode when creating zip files.</li>
<li>MlFront_Cache: Now embeds the sqlite3 C library so you don’t need pkg-config (etc.) to install it.</li>
<li>MlFront_Exec: Supports downloading attested (signed) binary packages from GitHub. Confer with my article on GitHub attestations: <a href="https://github.com/diskuv/dk/blob/V2_4/docs/posts/2025-10-24-overview-ci-attestations.md">https://github.com/diskuv/dk/blob/V2_4/docs/posts/2025-10-24-overview-ci-attestations.md</a></li>
<li>MlFront_Thunk: Its ThunkLexers and ThunkParsers include a JSONC parser that can be used to edit config files. Relies on the fmlib_parser library. I use it to autofix JSONC build files with correct checksums and file sizes. (Ping/reply if you would use it so I can separate it)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">Other OCaml News</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf98c5ab" class="outline-3">
<h3 id="orgf98c5ab">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-orgf98c5ab">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://fearful-odds.rocks/blog/setting-up-otel-with-ocaml-and-azure-monitor">Setting up Open Telemetry (OTel) with OCaml and Azure Monitor Integration</a></li>
<li><a href="https://www.youtube.com/watch/HVE9WWC0hbQ?version=3">Hacking OCaml</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6189a04" class="outline-2">
<h2 id="org6189a04">Old CWN</h2>
<div class="outline-text-2" id="text-org6189a04">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="org31467e8">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
